
Archived entries from file /Users/tonyday/.emacs.d/dotemacs.org


** TODO dovecot execution choices
:PROPERTIES:
:ID:       C94AFA9F-AB07-4CFE-9DCE-A16F1805D315
:ARCHIVE_TIME: 2012-12-16 Sun 23:06
:ARCHIVE_FILE: ~/.emacs.d/dotemacs.org
:ARCHIVE_OLPATH: packages/gnus/gnus r&d/gnus dev status
:ARCHIVE_CATEGORY: dotemacs
:ARCHIVE_TODO: TODO
:END:

- [ ] what is (nnimap-shell-program "/usr/local/opt/dovecot/libexec/dovecot/imap")
/usr/local/Cellar/dovecot/2.1.10/libexec/dovecot/imap
http://wiki2.dovecot.org/LaunchdInstall

#+begin_src sh
            ps auxw|grep "dovecot"

#+end_src

#+results:
| root    |    95 | 0.0 | 0.0 | 2433616 |   4 | ?? | S  | 8:37PM | 0:00.01 | dovecot/config          |         |
| root    |    91 | 0.0 | 0.0 | 2433284 |   4 | ?? | S  | 8:37PM | 0:00.00 | dovecot/log             |         |
| tonyday |    90 | 0.0 | 0.0 | 2433284 |   4 | ?? | S  | 8:37PM | 0:00.00 | dovecot/anvil           |         |
| root    |    71 | 0.0 | 0.0 | 2433328 |   4 | ?? | Ss | 8:37PM | 0:00.02 | /usr/local/sbin/dovecot | -F      |
| tonyday | 15142 | 0.0 | 0.0 | 2423540 | 180 | ?? | R  | 2:35PM | 0:00.00 | grep                    | dovecot |

ps auxw|grep "dovecot"
http://wiki.dovecot.org/TestInstallation

auth default {
..
  passdb passwd-file {
    args = /etc/passwd.dovecot
  }
protocols = imap
mail_location = maildir:~/Mail
auth default {
  passdb passwd-file {
    args = /etc/passwd.dovecot
  }
}



- [ ] (setq imap-shell-program
       (quote
        ("/opt/local/sbin/dovecot --exec-mail imap" 
         "ssh %s imapd"
         "rsh %s imapd"
         "ssh %g ssh %s imapd"
         "rsh %g rsh %s imapd")))
- [ ] (setq imap-shell-program "dovecot -c ~/.dovecotrc --exec-mail imap")
- [ ] '(offlineimap-command "offlineimap -u machineui")

*** NEXT gnus dev status
SCHEDULED: <2012-12-14 Fri>
:LOGBOOK:
CLOCK: [2012-12-16 Sun 09:35]--[2012-12-17 Mon 06:42] => 21:07
CLOCK: [2012-12-14 Fri 13:46]--[2012-12-15 Sat 18:32] => 28:46
:END:
:PROPERTIES:
:ID:       6069F551-22F4-4F47-B33E-CE9A07A70C32
:END:

refs
http://www.sanityinc.com/articles/read-mailing-lists-in-emacs-over-imap
http://stackoverflow.com/questions/9977182/how-to-integrate-dovecot-version-2-with-gnus-emacs

(gnus-refer-article-method

status
- offlineimap working from the terminal and start-offlineimap-regular, but not
  on the launchctl platform.  The problem might be due to an inability to
  pass gmail the passord(?)
    - [X] problem with getting password to gmail???
    - [X] check rc
- [X] lay in solid primary select method
- [X] scrape back old secondaries
- [X] add in scarce
  dovecot offlineimap setup needed
- [X] add newsreadings (and review setup)
- [X] smtp needs/changes
    - [X] immediately mail send might be ok


**** dev tools

What dovecot processes are running
#+begin_src sh
  ps auxw|grep "dovecot"
#+end_src

#+results:
| tonyday | 416 | 0.0 | 0.0 | 2433512 | 1048 | ?? | S  | 11:02PM | 0:00.00 | dovecot/auth            |         |
| root    |  81 | 0.0 | 0.0 | 2433284 |  880 | ?? | S  | 11:02PM | 0:00.00 | dovecot/log             |         |
| tonyday |  80 | 0.0 | 0.0 | 2433284 |  804 | ?? | S  | 11:02PM | 0:00.00 | dovecot/anvil           |         |
| root    |  71 | 0.0 | 0.0 | 2433328 |  988 | ?? | Ss | 11:02PM | 0:00.02 | /usr/local/sbin/dovecot | -F      |
| tonyday | 489 | 0.0 | 0.0 | 2424992 |  464 | ?? | R  | 11:05PM | 0:00.00 | grep                    | dovecot |

#+begin_src sh
  ps auxw|grep "offlineimap"
#+end_src

#+results:
| tonyday | 409 | 0.1 | 0.1 | 2504792 | 14876 | s001 | Ss+ | 11:02PM | 0:00.89 | /usr/local/Cellar/python/2.7.3/Frameworks/Python.framework/Versions/2.7/Resources/Python.app/Contents/MacOS/Python | /usr/local/bin/offlineimap |
| tonyday | 492 | 0.0 | 0.0 | 2424992 |   464 | ??   | R   | 11:05PM | 0:00.00 | grep                                                                                                               | offlineimap                |



*** secondaries
:PROPERTIES:
:tangle:   no
:END:
 #+begin_src emacs-lisp
(setq gnus-secondary-select-methods
   (quote
    ((nntp "GigaNews"
           (nntp-address "text.giganews.com")
           (nntp-authinfo-user "dabrahams"))
     (nntp "Gmane"
           (nntp-address "news.gmane.org"))
     (nnimap "GMail"
             (nnimap-address "imap.gmail.com")
             (nnimap-server-port 993)
             (nnimap-stream ssl)
             (nnimap-user "dave.abrahams@gmail.com"))
     (nntp "Gwene"
           (nntp-address "news.gwene.org")))))
 
#+end_src

 #+results:
 | nnimap | tonyday567 | (nnimap-address imap.gmail.com) |
 | nnml   |            |                                 |




*** various select method attempts and patterns
:PROPERTIES:
:tangle:   no
:END:

#+begin_src emacs-lisp
(setq gnus-select-method
   (quote
    (nnimap "LocalIMAP"
            (nnimap-address "localhost")
            (nnimap-user "tonyday")
            (nnimap-stream network))))
#+end_src


#+begin_src emacs-lisp
(setq imap-shell-method "/usr/local/sbin/dovecot")
(setq gnus-secondary-select-methods '((nnimap "mail" (nnimap-stream shell))))
(setq gnus-secondary-select-methods '((nnimap "localhost" (nnimap-stream network))))
(setq gnus-select-method (quote
  (nnimap "localhost" 
    (nnimap-stream network))))

'(gnus-secondary-select-methods (quote ((nnimap "scarce" (nnimap-address "imap.gmail.com") (nnimap-server-port 993) (nnimap-stream ssl) (nnimap-user "tony.day@scarcecapital.com")) (nntp "giganews" (nntp-address "text.giganews.com") (nntp-authinfo-user "tonyday567")) (nntp "gmane" (nntp-address "news.gmane.org")) (nntp "Gwene" (nntp-address "news.gwene.org")))))

(setq gnus-select-method '(nnimap "Local" (nnimap-stream shell)))


(setq gnus-select-method
  (quote
   (nnimap "localhost"
           (nnimap-stream shell)
           (nnimap-shell-program "/usr/local/sbin/dovecot"))))

#+end_src

#+results:
| nnimap | Local | (nnimap-stream shell) | (nnimap-shell-program /usr/local/sbin/dovecot/libexec/dovecot/imap) |




** DONE slow packages
CLOSED: [2012-12-28 Fri 23:57]
:LOGBOOK:
- State "DONE"       from "NEXT"       [2012-12-28 Fri 23:57]
CLOCK: [2012-12-28 Fri 20:29]--[2012-12-28 Fri 23:50] =>  3:21
:END:
:PROPERTIES:
:ARCHIVE_TIME: 2013-03-09 Sat 16:02
:ARCHIVE_FILE: ~/.emacs.d/dotemacs.org
:ARCHIVE_OLPATH: clipboard/debugs and tools/current startup bugz and readings
:ARCHIVE_CATEGORY: dotemacs
:ARCHIVE_TODO: DONE
:END:
Configuring package gnus...done (1.473s)
Loading package bbdb-gnus...done (0.905s)
Loading package org-magit...done (0.996s)
Configuring package erc...done (0.419s)
Loading package erc-yank...done (0.374s)
Loading /Users/tonyday/.emacs.d/dotemacs.el...done (10.830s) [after-init]

** NEXT tex development
:LOGBOOK:
CLOCK: [2013-02-24 Sun 21:13]--[2013-02-25 Mon 16:57] => 19:44
:END:
:PROPERTIES:
:tangle:   no
:ARCHIVE_TIME: 2013-03-16 Sat 13:39
:ARCHIVE_FILE: ~/.emacs.d/dotemacs.org
:ARCHIVE_OLPATH: packages/auctex
:ARCHIVE_CATEGORY: dotemacs
:ARCHIVE_TODO: NEXT
:END:
Some random old-school instructions

- best config
  - auctex-autoloads???
  - tex-site???
  - fix bug
  - reload helm


#+begin_src emacs-lisp
  (load "auctex.el" nil t t)
  (load "preview-latex.el" nil t t)
#+end_src

This gives you latex-mode
#+begin_src emacs-lisp
 (use-package latex)
  (use-package preview)
(use-package auctex-autoloads)
(use-package url)
#+end_src

** group load path table
:PROPERTIES:
:tangle:   no
:ARCHIVE_TIME: 2013-06-27 Thu 09:01
:ARCHIVE_FILE: ~/.emacs.d/dotemacs.org
:ARCHIVE_OLPATH: bootstrap/load-path
:ARCHIVE_CATEGORY: dotemacs
:END:

These directory groups (directory and sub-directories) are added to the path.

#+name: group-load-path-table
| directory               | toggle |
|-------------------------+--------|
| overides                | t      |
| elpa                    | t      |
| site-lisp               | t      |
| site-lisp/cedet         | t      |
| site-lisp/jwiegley-lisp | t      |
| site-lisp/ac            | t      |

And here's where we start taking advantage of using org on startup.
If you would like to add more group loads, just add to the above
table. You can temporarily turn anything off by deleting the toggle
row.

#+begin_src emacs-lisp :var table=group-load-path-table
(defvar group-load-directories
      (list "lisp" "site-lisp")
      "directories that should have their subdirectories added
to the load-path. Can be absolute or relative to user-emacs-directory")

(setq group-load-directories (org-table-list-and-toggle table))
(mapc #'add-to-load-path-include-subdirs
          (nreverse group-load-directories))
#+end_src

#+results:
| site-lisp/ac | site-lisp/jwiegley-lisp | site-lisp/cedet | site-lisp | elpa/auctex-11.86 | elpa | overides |

*** dependency checks
:PROPERTIES:
:tangle:   no
:END:

#+TBLNAME: table-elpa-check
| package              | check? | notes                      |
|----------------------+--------+----------------------------|
| auctex               | t      |                            |
| clojure-mode         |        |                            |
| elisp-slime-nav      | t      | add to sklisp              |
| find-file-in-project | t      | delay                      |
| idle-highlight-...   |        | didnt install properly     |
| ido-ubiquitous       | t      | package add elsewhere      |
| js-comint            |        |                            |
| js2-mode             |        |                            |
| json                 |        |                            |
| magit                | t      |                            |
| magithub             | t      | learn                      |
| org                  |        | direct from repo           |
| org-magit            |        |                            |
| org2blog             |        |                            |
| paredit              | t      |                            |
| slime                | t      | check                      |
| smex                 | t      |                            |
| xml-rpc              | t      | dep for org2blog           |
| yaml-mode            | t      | check                      |
| yasnippet            | t      |                            |
| zenburn-theme        | t      | check how themes are added |

#+begin_src emacs-lisp :var table=table-elpa-check
  (defvar package-list-to-check
        (list "")
        "packages that should be checked and loaded if not found")
  (setq package-list-to-check (org-table-list-and-toggle table))
      (unless package-archive-contents
        (package-refresh-contents))
      (dolist (package package-list-to-check)
         (eval (car (read-from-string (format "(unless (package-installed-p '%s)
                                               (package-install '%s))" package package)))))
#+end_src

#+begin_src emacs-lisp :var table=table-elpa-check
(org-table-list-and-toggle table)
#+end_src

#+results:
| auctex | elisp-slime-nav | find-file-in-project | ido-ubiquitous | magit | magithub | paredit | slime | smex | xml-rpc | yaml-mode | yasnippet | zenburn-theme |

** getting info directories right
:PROPERTIES:
:ARCHIVE_TIME: 2013-07-08 Mon 04:49
:ARCHIVE_FILE: ~/.emacs.d/dotemacs.org
:ARCHIVE_OLPATH: packages/info
:ARCHIVE_CATEGORY: dotemacs
:END:
#+TBLNAME: info-dirs
| /Users/tonyday/.emacs.d/info |
| /usr/share/info/             |
| ~/.emacs.d/site-lisp/auctex/doc      |

  #+begin_src emacs-lisp :var table=info-dirs
     (setq clean-table
           (delete nil
                   (loop for line in table
                         collect
                         (delete "" (delete-dups line)))))
    (setq Info-default-directory-list (apply #'append (list 


(list "/Users/tonyday/.emacs.d/info")
(list "/usr/share/info"))))
    (setq Info-directory-list Info-default-directory-list)
  #+end_src

  #+results:
  | /Users/tonyday/.emacs.d/info | /usr/share/info/ | ~/.emacs.d/site-lisp/auctex/doc |

** git repo list
:PROPERTIES:
:ARCHIVE_TIME: 2013-07-08 Mon 04:51
:ARCHIVE_FILE: ~/.emacs.d/dotemacs.org
:ARCHIVE_OLPATH: packages
:ARCHIVE_CATEGORY: dotemacs
:END:

#+name: git-repos
| ~/git/hft                   |
| ~/stuff                     |
| ~/.emacs.d                  |
| ~/git/o-blog                |
| ~/projects/opoker           |
| ~/projects/alice            |
| ~/projects/metalice         |
| ~/projects/fgr              |
| ~/git/tonyday567.github.com |


#+begin_src emacs-lisp :var table=git-repos
     (setq magit-repo-dirs
           (loop for file in table
                     collect (car file)))
#+end_src

#+results:
| ~/git/hft | ~/stuff | ~/.emacs.d | ~/git/o-blog | ~/projects/opoker | ~/projects/alice | ~/projects/metalice | ~/projects/fgr | ~/git/tonyday567.github.com |

** agenda-files
:PROPERTIES:
:tangle:   no
:ARCHIVE_TIME: 2013-07-08 Mon 04:51
:ARCHIVE_FILE: ~/.emacs.d/dotemacs.org
:ARCHIVE_OLPATH: packages/org-mode
:ARCHIVE_CATEGORY: dotemacs
:END:

Moved to the default agenda files control via custom.

Using tables as well for agenda files is very useful, especially for
quickly changing ordering.

#+TBLNAME: agenda-files
| .emacs.d |           | README.org                 |               |
| .emacs.d |           | dotemacs.org               |               |
| git      | acme      | acme.org                   |               |
| git      | o-blog    | example                    | oblog-min.org |
| stuff    |           | stuff.org                  |               |
| stuff    | biz       | scarce.org                 |               |
| stuff    | content   | allocation_final.org       |               |
| stuff    | content   | life.org                   |               |
| stuff    | content   | writing.org                |               |
| stuff    | content   | ideas.org                  |               |
| stuff    | content   | tail-material.org          |               |
| stuff    | content   | grob.org                   |               |
| stuff    | dev       | alice.org                  |               |
| stuff    | dev       | webdev.org                 |               |
| stuff    | dev       | sandpit                    | sandpit.org   |
| stuff    | dev       | dot.org                    |               |
| stuff    | dev       | beamer.org                 |               |
| stuff    | emacs     | emacs.org                  |               |
| stuff    | emacs     | bindings.org               |               |
| stuff    | factor    | factor.org                 |               |
| stuff    | org       | refile.org                 |               |
| stuff    | org       | bugz.org                   |               |
| stuff    | org       | snipz.org                  |               |
| stuff    | org       | org.org                    |               |
| stuff    | quant     | rdev.org                   |               |
| stuff    | quant     | volatility.org             |               |
| stuff    | quant     | strategy_run_annotated.org |               |
| stuff    | quant     | strategy_run_default.org   |               |
| stuff    | quant     | momentum.org               |               |
| stuff    | quant     | mom-report.org             |               |
| stuff    | quant     | jgb.org                    |               |
| stuff    | quant     | data.org                   |               |
| stuff    | quant     | quaff.org                  |               |
| stuff    | quant     | moments.org                |               |
| stuff    | quant     | da.org                     |               |
| stuff    | site      | site-dev.org               |               |
| stuff    | sys       | sys.org                    |               |
| projects | fgr       | fgr.org                    |               |
| projects | opoker    | opoker.org                 |               |
| projects | alice     | alice.org                  |               |
| projects | metaalice | metaalice.org              |               |

  #+begin_src emacs-lisp :var data=agenda-files
    (setq clean-table
          (delete nil
                  (loop for line in data
                        collect
                        (delete "" (delete-dups line)))))

    (setq org-agenda-files
          (mapcar
           (lambda (x)
             (concat "~/"
                     (mapconcat
                      'eval x "/")))
           clean-table))
  #+end_src

  #+results:
  | ~/.emacs.d/README.org | ~/.emacs.d/dotemacs.org | ~/git/acme/acme.org | ~/git/o-blog/example/oblog-min.org | ~/stuff/stuff.org | ~/stuff/biz/scarce.org | ~/stuff/content/allocation_final.org | ~/stuff/content/life.org | ~/stuff/content/writing.org | ~/stuff/content/ideas.org | ~/stuff/content/tail-material.org | ~/stuff/content/grob.org | ~/stuff/dev/alice.org | ~/stuff/dev/webdev.org | ~/stuff/dev/sandpit/sandpit.org | ~/stuff/dev/dot.org | ~/stuff/dev/beamer.org | ~/stuff/emacs/emacs.org | ~/stuff/emacs/bindings.org | ~/stuff/factor/factor.org | ~/stuff/org/refile.org | ~/stuff/org/bugz.org | ~/stuff/org/snipz.org | ~/stuff/org/org.org | ~/stuff/quant/rdev.org | ~/stuff/quant/volatility.org | ~/stuff/quant/strategy_run_annotated.org | ~/stuff/quant/strategy_run_default.org | ~/stuff/quant/momentum.org | ~/stuff/quant/mom-report.org | ~/stuff/quant/jgb.org | ~/stuff/quant/data.org | ~/stuff/quant/quaff.org | ~/stuff/quant/moments.org | ~/stuff/quant/da.org | ~/stuff/site/site-dev.org | ~/stuff/sys/sys.org | ~/projects/fgr/fgr.org | ~/projects/opoker/opoker.org | ~/projects/alice/alice.org | ~/projects/metaalice/metaalice.org |

